#Приветствие пользователя
# name = input('Введите ваше имя: ')
# print(f"Привет, {name}! Добро пожаловать!")

#Любимая цитата
# quote = input('Введите любимую цитату: ')
# author = input('Введите автора цитаты: ')
# print(f'{quote} \n{author}')

# quote = input('Введите любимую цитату: ')
# author = input('Введите автора цитаты: ')
# print(f'"{quote}" - {author}')

#Повторение строки
# word = input('Введите любое слово: ')
# times = int(input('Сколько раз нужно посторить слово? '))
# print((f'{word}')*times)

#Случай с текстом
# phrase = input("Введите любую фразу: ")
# print(phrase.upper())
# print(phrase.lower())

#Работа с числами
#Простой калькулятор площади прямоугольника
# width = float(input('Введите ширину прямоугольника в см: '))
# height = float(input('Введите высоту прямоугольника в см: '))
# print(f'Площадь прямоугольника: {width*height} кв.см')

# width = int(input('Введите ширину прямоугольника в см: '))
# height = int(input('Введите высоту прямоугольника в см: '))
# print(f'Площадь прямоугольника: {width*height} кв.см')

#Возраст в месяцах
# age = int(input('Введите возраст в годах: '))
# print(f'Ваш возраст составляет примерно {age*12} месяцев.')

#Условные операторы
#Доступ к клубу (возраст и имя)
# name = input('Введите ваше имя: ')
# age = int(input('Введите ваш возраст: '))
# if name != 'Ибрагим' and age >= 18:
#     print('Доступ разрешен!')
# else:
#     print('Доступ запрещен!')